app/controllers/fournisseurs_controller.rb

SELECT "fournisseurs".* FROM "fournisseurs"
---
  def index
    @fournisseurs = Fournisseur.all

INSERT INTO "fournisseurs" ("nom", "adresse", "tel", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nom", "Fournisseur01"], ["adresse", "1234 chemin du Roy, Qc, Canada"], ["tel", "418 444 4444"], ["created_at", "2018-02-18 14:45:31.460182"], ["updated_at", "2018-02-18 14:45:31.460182"]]
---
  def create
    @fournisseur = Fournisseur.create!(fournisseur_params)

UPDATE "fournisseurs" SET "nom" = ?, "updated_at" = ? WHERE "fournisseurs"."id" = ?  [["nom", "Fournisseur02"], ["updated_at", "2018-02-18 14:45:31.677597"], ["id", 1]]
---
  def update
    @fournisseur.update(fournisseur_params)

DELETE FROM "fournisseurs" WHERE "fournisseurs"."id" = ?  [["id", 1]]
---
  def destroy
    @fournisseur.destroy

SELECT  "fournisseurs".* FROM "fournisseurs" WHERE "fournisseurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_fournisseur
    @fournisseur = Fournisseur.find(params[:id])