app/controllers/produits_controller.rb

  def create
    @fournisseur.produits.create!(produit_params)
---
INSERT INTO "produits" ("nom", "quantite", "description", "prix", "fournisseur_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @produit.update(produit_params)
---
UPDATE "produits" SET "nom" = ?, "quantite" = ?, "description" = ?, "prix" = ?, "updated_at" = ? WHERE "produits"."id" = ?  [["nom", "Produit 02"], ["quantite", 10], ["description", "desc"], ["prix", 1.0], ["updated_at", "2018-02-18 14:44:01.841415"], ["id", 1]]

  def destroy
    @produit.destroy
---
DELETE FROM "produits" WHERE "produits"."id" = ?  [["id", 1]]

  def set_fournisseur
    @fournisseur = Fournisseur.find(params[:fournisseur_id])
---
SELECT  "fournisseurs".* FROM "fournisseurs" WHERE "fournisseurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_fournisseur_produit
    @produit = @fournisseur.produits.find_by!(id: params[:id]) if @fournisseur
---
SELECT  "produits".* FROM "produits" WHERE "produits"."fournisseur_id" = ? AND "produits"."id" = ? LIMIT ?  [["fournisseur_id", 1], ["id", 1], ["LIMIT", 1]]